studysfu/app/controllers/comments_controller.rb

  def create
    @link = Link.find(params[:link_id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", nil]]