studysfu/app/controllers/links_controller.rb

SELECT "links".* FROM "links"
---
  def index
    @links = Link.paginate(page: params[:page])

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    def set_link
      @link = Link.find(params[:id])