studysfu/app/controllers/password_resets_controller.rb

  def update
      if params[:user][:password].empty?
        @user.errors.add(:password, "can't be empty")
        render 'edit'
      elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$04$ZWgiCq.OuX3duJA/dvF34.Z/X.niq719ZEWEmXypM6zeDUKSzc/36"], ["updated_at", "2015-11-21 09:41:51.297661"], ["id", 762146111]]