studysfu/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "firstName", "lastName", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 762146111]]
---
  def update
    #respond_to do |format|
     @user = User.find(params[:id])