studysfu/app/views/users/show.html.erb

SELECT  1 AS one FROM "links" WHERE "links"."user_id" = $1 LIMIT 1  [["user_id", 1046959425]]
---
    <div class="container-fluid">
      <% if @user.links.any? %>